src/Catalogs/КлючиОбновлений/КлючиОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиОбновлений</name>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаИБ</name>
    <type>
      <types>EnumRef.ТипыОбъектовИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектИБ</name>
    <type>
      <types>DefinedType.ОбъектИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>DefinedType.ВерсияОбъектаИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяВерсия</name>
    <type>
      <types>DefinedType.ВерсияОбъектаИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/КлючиОбновлений/Module.bsl
Функция ПолучитьЭлемент(ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия) Экспорт
	
	Ссылка = НайтиЭлемент(ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия);
	КонецЕсли;
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиОбновлений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлючиОбновлений КАК КлючиОбновлений
		|ГДЕ
		|	КлючиОбновлений.ИнформационнаяБаза = &ИнформационнаяБаза
		|	И КлючиОбновлений.ТипОбъектаИБ = &ТипОбъектаИБ
		|	И КлючиОбновлений.ОбъектИБ = &ОбъектИБ
		|	И КлючиОбновлений.ТекущаяВерсия = &ТекущаяВерсия
		|	И КлючиОбновлений.НоваяВерсия = &НоваяВерсия";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ТипОбъектаИБ", ТипОбъектаИБ);
	Запрос.УстановитьПараметр("ОбъектИБ", ОбъектИБ);
	Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
	Запрос.УстановитьПараметр("НоваяВерсия", НоваяВерсия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.КлючиОбновлений.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Наименование = СтрШаблон("%1; %2; %3; %4; %5", ИнформационнаяБаза, ТипОбъектаИБ, ОбъектИБ, ТекущаяВерсия, НоваяВерсия);
	
	Объект = Справочники.КлючиОбновлений.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.ИнформационнаяБаза = ИнформационнаяБаза;
	Объект.ТипОбъектаИБ = ТипОбъектаИБ;
	Объект.ОбъектИБ = ОбъектИБ;
	Объект.ТекущаяВерсия = ТекущаяВерсия;
	Объект.НоваяВерсия = НоваяВерсия;
	Объект.ДатаОбнаружения = ТекущаяДата;	
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции
